ExchangePlans/ОбменСУРМК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<ExchangePlan>
		<Properties>
			<Name>ОбменСУРМК</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВариантНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияФорматаОбмена</Name>
					<Comment>Версия формата обмена в формате ХХ.ХХ.ХХ.ХХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВидЦенУРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьЗаказы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьОстаткиНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьСерии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьТолькоТоварыПалитры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьФизическихЛиц</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьФизическихЛицЧастично</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаВыгрузкиДокументов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзмененыНастройкиУзла</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОтборПоОрганизациям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрироватьИзменения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимВыгрузкиПриНеобходимости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыВыгрузкиОбъектовОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговыйОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТорговыйОбъектУРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКассаВозврата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКонтрагентВозврата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УРМК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УниверсальныеРабочиеМестаКассиров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьКартыЛояльностиВРМК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьШаблоныЧеков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонЧекаПродажи</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ХранилищеШаблоновРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонЧекаВозврата</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ХранилищеШаблоновРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Организации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОрганизацияУРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КассыККМ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КассаККМ</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КассаККМУРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьНастройкиВозвратаРасширенногоРежима</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОрганизацияУРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КассаВозврата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокФизическихЛицДляВыгрузки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПалитрыТоваровДляВыгрузки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПалитраТоваровРМК</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПалитраТоваровРМК</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаНастройкиПользователей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСотрудника</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>13</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СотрудникСсылка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПользовательСсылка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПользовательСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

ExchangePlans/ОбменСУРМК/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Перем РазрешенРасширенныйРежимНастройкиОбменаУРМК;
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	РежимВыгрузкиПриНеобходимости = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПриНеобходимости;
	
	ЗарегистрироватьТорговыйОбъектКОтправкеПриНеобходимости();
	ЗарегистрироватьВидЦенКОтправкеПриНеобходимости();
	ЗарегистрироватьСотрудникаПриНеобходимости();
	
	Если ВыгружатьТолькоТоварыПалитры Тогда
		РежимВыгрузкиПриНеобходимости = Перечисления.РежимыВыгрузкиОбъектовОбмена.ПустаяСсылка();
	КонецЕсли;
	
	Если ОбменДаннымиСервер.НадоВыполнитьОбработчикПослеЗагрузкиДанных(ЭтотОбъект, Ссылка) Тогда
		ПослеЗагрузкиДанных(Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеЗагрузкиДанных(Отказ)

	ВыполнитьОтложеннуюОбработкуОбъектов(Отказ);

КонецПроцедуры

#КонецОбласти

#Область ОтложеннаяОбработка

Процедура ВыполнитьОтложеннуюОбработкуОбъектов(Отказ)
	
	СброситьФлагИзмененияНастроекУзла();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗарегистрироватьТорговыйОбъектКОтправкеПриНеобходимости()
	
	Если ЗначениеЗаполнено(ТорговыйОбъект)
			И Не (Ссылка.Пустая() Или (ВыгружатьФизическихЛицЧастично = Ссылка.ВыгружатьФизическихЛицЧастично И ВыгружатьСерии = Ссылка.ВыгружатьСерии)) Тогда
			
		ПланыОбмена.ЗарегистрироватьИзменения(Ссылка, ТорговыйОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗарегистрироватьСотрудникаПриНеобходимости()
	Если Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаСсылка = Ссылка.ТаблицаНастройкиПользователей;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТаблицаСсылка.СотрудникСсылка КАК СотрудникСсылка,
	|	ТаблицаСсылка.ПользовательСсылка КАК ПользовательСсылка,
	|	ТаблицаСсылка.ПользовательСтрока КАК ПользовательСтрока,
	|	ТаблицаСсылка.КодСотрудника КАК КодСотрудника,
	|	ТаблицаСсылка.Роль КАК Роль
	|ПОМЕСТИТЬ НастройкиСсылка
	|ИЗ
	|	&ТаблицаСсылка КАК ТаблицаСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСсылка.СотрудникСсылка КАК СотрудникСсылка,
	|	ТаблицаСсылка.ПользовательСсылка КАК ПользовательСсылка,
	|	ТаблицаСсылка.ПользовательСтрока КАК ПользовательСтрока,
	|	ТаблицаСсылка.КодСотрудника КАК КодСотрудника,
	|	ТаблицаСсылка.Роль КАК Роль
	|ПОМЕСТИТЬ НастройкиОбъект
	|ИЗ
	|	&ТаблицаОбъект КАК ТаблицаСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НастройкиСсылка.СотрудникСсылка КАК СотрудникСсылка,
	|	ВЫБОР
	|		КОГДА НастройкиОбъект.СотрудникСсылка ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СотрудуникИзменен,
	|	ВЫБОР
	|		КОГДА НастройкиСсылка.ПользовательСсылка <> НастройкиОбъект.ПользовательСсылка
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПользовательСсылкаИзменен,
	|	ВЫБОР
	|		КОГДА НастройкиСсылка.ПользовательСтрока <> НастройкиОбъект.ПользовательСтрока
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПользовательСтрокаИзменен,
	|	ВЫБОР
	|		КОГДА НастройкиСсылка.КодСотрудника <> НастройкиОбъект.КодСотрудника
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК КодСотрудникаИзменен,
	|	ВЫБОР
	|		КОГДА НастройкиСсылка.Роль <> НастройкиОбъект.Роль
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РольИзменена
	|ПОМЕСТИТЬ РезультатТаблица
	|ИЗ
	|	НастройкиСсылка КАК НастройкиСсылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиОбъект КАК НастройкиОбъект
	|		ПО НастройкиСсылка.СотрудникСсылка = НастройкиОбъект.СотрудникСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РезультатТаблица.СотрудникСсылка КАК СотрудникСсылка
	|ИЗ
	|	РезультатТаблица КАК РезультатТаблица
	|ГДЕ
	|	РезультатТаблица.СотрудуникИзменен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РезультатТаблица.СотрудникСсылка
	|ИЗ
	|	РезультатТаблица КАК РезультатТаблица
	|ГДЕ
	|	РезультатТаблица.ПользовательСсылкаИзменен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РезультатТаблица.СотрудникСсылка
	|ИЗ
	|	РезультатТаблица КАК РезультатТаблица
	|ГДЕ
	|	РезультатТаблица.ПользовательСтрокаИзменен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РезультатТаблица.СотрудникСсылка
	|ИЗ
	|	РезультатТаблица КАК РезультатТаблица
	|ГДЕ
	|	РезультатТаблица.КодСотрудникаИзменен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РезультатТаблица.СотрудникСсылка
	|ИЗ
	|	РезультатТаблица КАК РезультатТаблица
	|ГДЕ
	|	РезультатТаблица.РольИзменена";
	Запрос.УстановитьПараметр("ТаблицаСсылка", ТаблицаСсылка);
	Запрос.УстановитьПараметр("ТаблицаОбъект", ТаблицаНастройкиПользователей);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ПланыОбмена.ЗарегистрироватьИзменения(Ссылка, Выборка.СотрудникСсылка);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ЗарегистрироватьВидЦенКОтправкеПриНеобходимости()
	
	Если ЗначениеЗаполнено(ВидЦен)
		И Не (Ссылка.Пустая() Или (ВидЦен = Ссылка.ВидЦен)) Тогда
		
		ПланыОбмена.ЗарегистрироватьИзменения(Ссылка, ВидЦен);
		ПланыОбмена.ЗарегистрироватьИзменения(Ссылка, ТорговыйОбъект);

		ИзмененыНастройкиУзла = Истина;
	КонецЕсли;
		
КонецПроцедуры

Процедура СброситьФлагИзмененияНастроекУзла()
	
	НомерОтправленного = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "НомерОтправленного");
	ВыборкаИзменений   = ПланыОбмена.ВыбратьИзменения(Ссылка, НомерОтправленного);
	Если ВыборкаИзменений.Следующий() Тогда
		Возврат;
	КонецЕсли;

	ИзмененыНастройкиУзла = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
